package ru.application.tasktracking;


public class Main {

    public static void main(String[] args) {

        /*
        Привет, Патимат!

        Часть комментариев не стал удалять, уверен ещё будут исправления.
        Решил что при передачи задач в менеджер  будут ограничения в 15 минут периоды.
        То есть задача может начинаться 00, 15, 30, 45 минут, как по заданию пересечения за O(1), хотя у меня не получилось.

        Пустые здачи можно добавить, если у них есть старт времени, но нет продолжительности. Могу исправить.


        По тестам много вопросов. Нужно ли проверять пустой список задач перед созданием, он же вроде и так пустой.

        Для каждого метода нужно проверить его работу:
            b. С пустым списком задач.
            c. С неверным идентификатором задачи (пустой и/или несуществующий идентификатор).

        b. Например при создании задачи, что проверять с пустым списком.
        с. как понял это проверка на null, где то в методах проверил, это надо обязательно в каждом?
        Некоторые параметры возвращают 0, их тоже проверять?

        И вопрос по файлам, например TestSaveLoadManager.csv, их принято добавлять на Git? (если не параметизированный тест)

        Пока что жду основные замечания, направления в верную сторону. После буду исправлять. Спасибо))

*/
    }
}